In [1]:
import pandas as pd
import mysql.connector as conn

mydb = conn.connect(host = 'localhost', user = 'root', password="root")
cursor = mydb.cursor()

# Q-1. Write an SQL query to print the FIRST_NAME from Worker table after removing white spaces from the right side.

In [3]:
data_1 = pd.read_sql("SELECT RTRIM(First_Name) FROM employees.Worker", mydb)
data_1

   RTRIM(First_Name)
0               Siva
1            Ranjini
2            sankare
3         Valarmathi
4           Poovitha
5            Ananaya
6            Aayushi
7            Suganya
8               Raju
9                Ram
10         Shanmathi
11               Jin
12              Babu
13          Saravana
14           Murugan
15               Vel
16              Mani
17           Amitabh

# Q-2. Write an SQL query that fetches the unique values of DEPARTMENT from Worker table and prints its length.

In [10]:
data_2 = pd.read_sql("Select Distinct department ,length(department) from employees.Worker" , mydb)
data_2

    department  length(department)
0           IT                   2
1         Engg                   4
2  Content Dev                  11
3         Mech                   4
4       Tester                   6
5     Accounts                   8

# Q-3. Write an SQL query to fetch nth max salaries from a table.

In [15]:
n = 3

In [19]:
data_3 = pd.read_sql("SELECT Salary FROM employees.worker ORDER BY Salary DESC LIMIT {n} , 1".format(n=n-1),mydb)
data_3

   Salary
0  250000